case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          4566;
        startFace       3327;
    }

    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          7;
        startFace       7893;
    }

    walls
    {
        type            wall;
        physicalType    wall;
        nFaces          28;
        startFace       7900;
    }

    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          7;
        startFace       7928;
    }

    airfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          153;
        startFace       7935;
    }

)


// ************************************************************************* //
